{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "20817933",
   "metadata": {},
   "source": [
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "\n",
    "Исходные данные имеют следующую структуру:\n",
    "\n",
    "1. перечень всех документов\n",
    "\n",
    "documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "2.перечень полок, на которых хранятся документы (если документ есть в documents, то он обязательно должен быть и в directories)\n",
    "\n",
    "directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}\n",
    "\n",
    "Общие требования к программе:\n",
    "код должен быть грамотно декомпозирован: каждая функция отвечает за свою конкретную задачу, дублирующиеся функции переиспользуются, а их код не повторяется;\n",
    "в коде отсутствуют глобальные переменные, за исключением documents и directories;\n",
    "пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу вводом команды «q».\n",
    "\n",
    "Задание 1\n",
    "Пользователь по команде «p» может узнать владельца документа по его номеру.\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "Введите команду:\n",
    "p\n",
    "\n",
    "Введите номер документа:\n",
    "10006\n",
    "\n",
    "Результат:\n",
    "Владелец документа: Аристарх Павлов\n",
    "\n",
    "Задание 2 (не обязательное)\n",
    "Секретарь по команде «s» может по номеру документа узнать, на какой полке документ хранится.\n",
    "\n",
    "Пример работы программы:\n",
    "Введите команду:\n",
    "s\n",
    "\n",
    "Введите номер документа:\n",
    "10006\n",
    "\n",
    "Результат:\n",
    "Документ хранится на полке: 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5a1c8688",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3a2b4e15",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9d01b285",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Возможные команды: p, s\n",
      "Введите название команды p\n",
      "Введите номер документа 10006\n",
      "Аристарх Павлов\n",
      "Возможные команды: p, s\n",
      "Введите название команды p\n",
      "Введите номер документа 10005\n",
      "Документа с таким номером нет\n",
      "Возможные команды: p, s\n",
      "Введите название команды s\n",
      "Введите номер документа 10005\n",
      "В полках документа с данным номером нет.\n",
      "Возможные команды: p, s\n",
      "Введите название команды s\n",
      "Введите номер документа 11-2\n",
      "1\n",
      "Возможные команды: p, s\n"
     ]
    }
   ],
   "source": [
    "def get_name():\n",
    "    number = input('Введите номер документа ')\n",
    "    for data in documents:\n",
    "        if data.get(\"number\") == number:\n",
    "            return data.get('name')\n",
    "    return 'Документа с таким номером нет'\n",
    " \n",
    "def get_shelf():\n",
    "    number = input('Введите номер документа ')\n",
    "    for key in directories :\n",
    "        if number in directories.get(key):\n",
    "            return key\n",
    "    return 'В полках документа с данным номером нет.'\n",
    " \n",
    "documents = [\n",
    "        {\"type\": \"passport\", \"number\": \"2207 876234\", \"name\": \"Василий Гупкин\"},\n",
    "        {\"type\": \"invoice\", \"number\": \"11-2\", \"name\": \"Геннадий Покемонов\"},\n",
    "        {\"type\": \"insurance\", \"number\": \"10006\", \"name\": \"Аристарх Павлов\"}\n",
    "      ]\n",
    " \n",
    "directories = {\n",
    "        '1': ['2207 876234', '11-2'],\n",
    "        '2': ['10006'],\n",
    "        '3': []\n",
    "      }\n",
    " \n",
    "while True:\n",
    "    print('Возможные команды: p, s')\n",
    "    comand = input('Введите название команды ')\n",
    " \n",
    "    if comand == 'p':\n",
    "        print(get_name())\n",
    "    \n",
    "    elif comand == 's':\n",
    "        print(get_shelf())\n",
    "break        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "02b5e4fc",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d4cf675d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
